Autodesk.Revit.DB.ADPInformation.SessionId
Returns the current session id.
Since:
2023

Autodesk.Revit.DB.ADPInformation.ProductId
Returns the product id.
Since:
2023

Autodesk.Revit.DB.ADPInformation
This class holds information for internal use only.
Since:
2023